{
   "name":"A Walk in the Park",
   "tagline":"Cooperative Walking Simulator",
   "sections": [
        {
            "name": "ABOUT",
            "details": "A Walk in the Park is a local four-player cooperative walking simulator, developed over the course of three months with a team of four people: an artist - <a>http://kduffy.squarespace.com/--Katherine Duffy<a>; a composer – <a>http://ianwonilkim.wixsite.com/page--Ian Wonil Kim<a>; a producer/designer – <a>https://mike-effenberger.itch.io/--Mike Effenberger<a>; and a programmer/designer – me.\n\nInspired by the feeling of walking down a sidewalk with a group and not quite having enough room for everyone to be walking next to the person they want to walk with, A Walk in the Park tasks each player with a separate interpersonal goal, which could be anything from trying to be in the middle of the group to trying to keep two other people together. In order to win the game, all four players must complete their goals before time runs out while avoiding pedestrians"
        },
        {
            "name": "LOOKING BACK",
            "details": "A Walk in the Park was the first Unity project that I worked on, and as the only programmer on the team, I learned a lot about not only Unity, but also about interfacing with non-technical teammates. To make life easier for the team as a whole, we often shared the project using Google Drive, which eliminated issues with people not knowing how to use version control, but also eliminated all of the benefits of version control. A large chunk of my time was spent checking files that differed and manually resolving merge conflicts. In hindsight, using version control would have saved a great deal of time, but as the project was only three months, the up-front cost to teach everyone on the team seemed an unnecessary one.\n\nWhile I was the only programmer on the team, I was one of two designers. Mike and I worked closely together on the whole game, which presented a change from previous projects where different people would design different parts of the game. We had several disagreements, from little ones regarding choices of assets to larger ones regarding whether the game should have a competitive element to it. However, all of our differences of opinion were resolved amicably, and both of us were extremely happy with the final results"
        },
        {
            "name": "INTERESTING PROBLEM",
            "details": "The most interesting problem that I encountered during this game was how to determine if two players were adjacent to one another, which side they were on, and how to communicate this information to the player. From a design standpoint, players were next to one another if they were close to being in a horizontal line, but not if they were in a vertical one.  From a UX standpoint, the side is easy to communicate, and adjacency is harder. To accomplish this, I added a rope of dots that would extend between players when they were adjacent, using the colors of the two players so that players could quickly determine adjacency.\n\nFrom a technical standpoint, 3-D math was required to solve this. First, I checked each of the other players to determine the closest player on each side by distance. If they were within a certain distance and inside a specific degree arc, they were stored in a map. Once each player had checked the other players, any relative values in the map (ex. Player 1 maps right side to Player 2 and Player 2 maps left side to Player 1) were considered adjacent. There are certainly more efficient ways of doing this, but with only four players and only twelve necessary checks, it didn’t seem essential to maximize efficiency of this."
        }
   ],
   "images":[
      {
         "link":"http://josephboman.com/images/a-walk-in-the-park-1.png",
         "alt":"A Walk in the Park 1"
      },
      {
         "link":"http://josephboman.com/images/a-walk-in-the-park-2.png",
         "alt":"A Walk in the Park 2"
      },
      {
         "link":"http://josephboman.com/images/a-walk-in-the-park-3.png",
         "alt":"A Walk in the Park 3"
      },
      {
         "link":"http://josephboman.com/images/a-walk-in-the-park-4.png",
         "alt":"A Walk in the Park 4"
      }
   ],
   "tags":[
      {
         "name":"coder",
         "text":"Built in Unity using C#"
      },
      {
         "name":"designer",
         "text":"Designed gameplay mechanics and systems"
      }
   ],
   "downloadType":"Windows",
   "downloadLink":"https://docs.google.com/uc?id=0BwZrt8zDIOLPd1hXRlBVQ3ZWaTQ&export=download",
   "bufferType":"project"
}
