{
   "name":"MonoVirus",
   "tagline":"Action RPG Dungeon Crawler Game",
   "sections": [
        {
            "name": "ABOUT",
            "details": "MonoVirus was a project that I worked on with three other engineers – <a>http://www.zachvp.com/--Zach Vega-Perkins<a>, <a>http://www.mathewschacher.com/--Mathew Schacher<a>, and <a>https://www.linkedin.com/in/cherys-fair-b81b1380/--Cherys Fair<a>. We wanted to create a dungeon crawler with a darker twist, much like games like Pandemic. To do this, we created a procedurally generated dungeon that gave the appearance of blood vessels, and crafted our player character and our enemy characters as if they were a virus and human cells (respectively).\n\nThe player must make their way through the blood vessel system to the heart, fighting various antibodies and white blood cells along the way. Upon arriving, they must defeat a stronger defensive cell in order to completely overwhelm the body's defenses. At this point, the player enters a new procedurally generated body where the enemies are more difficult. This repeats until the player can no longer fight their way through"
        },
        {
            "name": "LOOKING BACK",
            "details": "Since the team was composed entirely of engineers, I ended up doing a great deal of design work over the course of the project. I created all of the UI elements in the game, primarily using GIMP, and also created all of the 3D models for the characters. It was an interesting challenge, since in the past, I had done minimal design work. Due to that fact, there was no cohesive art direction - rather I was just building models and resources that were needed, without trying to get them to fit together. If I were to do this project again, that's something I would set out to achieve.\n\nDespite that, I still found plenty of time to program as well, which was a great learning experience for me, as it was my first time working with C#, MonoGame, and XNA. Most of the programming I did revolved around the high level gameplay elements, such as tracking player health and experience, allowing the player to level up, and switching from one level to the next. I also, since I had created the models, wrote the code to switch between models as a basic form of animation, as our models were simplistic, containing no skeletons or animations"
        }
   ],
   "images":[
      {
         "link":"http://josephboman.com/images/monovirus-1.png",
         "alt":"MonoVirus-1"
      },
      {
         "link":"http://josephboman.com/images/monovirus-2.png",
         "alt":"MonoVirus-2"
      },
      {
         "link":"http://josephboman.com/images/monovirus-3.png",
         "alt":"MonoVirus-3"
      }
   ],
   "tags":[
      {
         "name":"coder",
         "text":"Built in C# using XNA and MonoDevelop"
      },
      {
         "name":"modeler",
         "text":"Designed player and enemy models in Maya"
      },
      {
         "name":"ui/ux",
         "text":"Created UI elements using GIMP"
      }
   ],
   "downloadType":"Windows",
   "downloadLink":"https://docs.google.com/uc?id=0BwZrt8zDIOLPOWQ4MExTWXRYZmc&export=download",
   "bufferType":"project"
}
